Ac6Embedded/svd-microchip/PIC32CZ_MC70/PIC32CZ1038MC70100.svd
            <register>
               <dim>10</dim>
               <dimIncrement>4</dimIncrement>
               <name>DEVEPTISR_ISO_MODE[%s]</name>
               <description>Device Endpoint Interrupt Status Register</description>
               <alternateRegister>DEVEPTISR_CTRL_MODE[%s]</alternateRegister>
               <addressOffset>0x130</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>TXINI</name>
                     <description>Transmitted IN Data Interrupt</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXOUTI</name>
                     <description>Received OUT Data Interrupt</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UNDERFI</name>
                     <description>Underflow Interrupt</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HBISOINERRI</name>
                     <description>High Bandwidth Isochronous IN Underflow Error Interrupt</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HBISOFLUSHI</name>
                     <description>High Bandwidth Isochronous IN Flush Interrupt</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVERFI</name>
                     <description>Overflow Interrupt</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CRCERRI</name>
                     <description>CRC Error Interrupt</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SHORTPACKET</name>
                     <description>Short Packet Interrupt</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DTSEQ</name>
                     <description>Data Toggle Sequence</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>DTSEQSelect</name>
                        <enumeratedValue>
                           <name>DATA0</name>
                           <description>Data0 toggle sequence</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DATA1</name>
                           <description>Data1 toggle sequence</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DATA2</name>
                           <description>Reserved for high-bandwidth isochronous endpoint</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>MDATA</name>
                           <description>Reserved for high-bandwidth isochronous endpoint</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ERRORTRANS</name>
                     <description>High-bandwidth Isochronous OUT Endpoint Transaction Error Interrupt</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NBUSYBK</name>
                     <description>Number of Busy Banks</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>NBUSYBKSelect</name>
                        <enumeratedValue>
                           <name>_0_BUSY</name>
                           <description>0 busy bank (all banks free)</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_1_BUSY</name>
                           <description>1 busy bank</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_2_BUSY</name>
                           <description>2 busy banks</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_3_BUSY</name>
                           <description>3 busy banks</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CURRBK</name>
                     <description>Current Bank</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>CURRBKSelect</name>
                        <enumeratedValue>
                           <name>BANK0</name>
                           <description>Current bank is bank0</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BANK1</name>
                           <description>Current bank is bank1</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BANK2</name>
                           <description>Current bank is bank2</description>
                           <value>0x2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RWALL</name>
                     <description>Read/Write Allowed</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CFGOK</name>
                     <description>Configuration OK Status</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BYCT</name>
                     <description>Byte Count</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>11</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>10</dim>
               <dimIncrement>4</dimIncrement>
               <name>DEVEPTISR_BLK_MODE[%s]</name>
               <description>Device Endpoint Interrupt Status Register</description>
               <alternateRegister>DEVEPTISR_CTRL_MODE[%s]</alternateRegister>
               <addressOffset>0x130</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>TXINI</name>
                     <description>Transmitted IN Data Interrupt</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXOUTI</name>
                     <description>Received OUT Data Interrupt</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXSTPI</name>
                     <description>Received SETUP Interrupt</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NAKOUTI</name>
                     <description>NAKed OUT Interrupt</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NAKINI</name>
                     <description>NAKed IN Interrupt</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVERFI</name>
                     <description>Overflow Interrupt</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>STALLEDI</name>
                     <description>STALLed Interrupt</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SHORTPACKET</name>
                     <description>Short Packet Interrupt</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DTSEQ</name>
                     <description>Data Toggle Sequence</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>DTSEQSelect</name>
                        <enumeratedValue>
                           <name>DATA0</name>
                           <description>Data0 toggle sequence</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DATA1</name>
                           <description>Data1 toggle sequence</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DATA2</name>
                           <description>Reserved for high-bandwidth isochronous endpoint</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>MDATA</name>
                           <description>Reserved for high-bandwidth isochronous endpoint</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>NBUSYBK</name>
                     <description>Number of Busy Banks</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>NBUSYBKSelect</name>
                        <enumeratedValue>
                           <name>_0_BUSY</name>
                           <description>0 busy bank (all banks free)</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_1_BUSY</name>
                           <description>1 busy bank</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_2_BUSY</name>
                           <description>2 busy banks</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_3_BUSY</name>
                           <description>3 busy banks</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CURRBK</name>
                     <description>Current Bank</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>CURRBKSelect</name>
                        <enumeratedValue>
                           <name>BANK0</name>
                           <description>Current bank is bank0</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BANK1</name>
                           <description>Current bank is bank1</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BANK2</name>
                           <description>Current bank is bank2</description>
                           <value>0x2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RWALL</name>
                     <description>Read/Write Allowed</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CTRLDIR</name>
                     <description>Control Direction</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CFGOK</name>
                     <description>Configuration OK Status</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BYCT</name>
                     <description>Byte Count</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>11</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>10</dim>
               <dimIncrement>4</dimIncrement>
               <name>DEVEPTISR_INTRPT_MODE[%s]</name>
               <description>Device Endpoint Interrupt Status Register</description>
               <alternateRegister>DEVEPTISR_CTRL_MODE[%s]</alternateRegister>
               <addressOffset>0x130</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>TXINI</name>
                     <description>Transmitted IN Data Interrupt</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXOUTI</name>
                     <description>Received OUT Data Interrupt</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXSTPI</name>
                     <description>Received SETUP Interrupt</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NAKOUTI</name>
                     <description>NAKed OUT Interrupt</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NAKINI</name>
                     <description>NAKed IN Interrupt</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVERFI</name>
                     <description>Overflow Interrupt</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>STALLEDI</name>
                     <description>STALLed Interrupt</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SHORTPACKET</name>
                     <description>Short Packet Interrupt</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DTSEQ</name>
                     <description>Data Toggle Sequence</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>DTSEQSelect</name>
                        <enumeratedValue>
                           <name>DATA0</name>
                           <description>Data0 toggle sequence</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DATA1</name>
                           <description>Data1 toggle sequence</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DATA2</name>
                           <description>Reserved for high-bandwidth isochronous endpoint</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>MDATA</name>
                           <description>Reserved for high-bandwidth isochronous endpoint</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>NBUSYBK</name>
                     <description>Number of Busy Banks</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>NBUSYBKSelect</name>
                        <enumeratedValue>
                           <name>_0_BUSY</name>
                           <description>0 busy bank (all banks free)</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_1_BUSY</name>
                           <description>1 busy bank</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_2_BUSY</name>
                           <description>2 busy banks</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_3_BUSY</name>
                           <description>3 busy banks</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CURRBK</name>
                     <description>Current Bank</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>CURRBKSelect</name>
                        <enumeratedValue>
                           <name>BANK0</name>
                           <description>Current bank is bank0</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BANK1</name>
                           <description>Current bank is bank1</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BANK2</name>
                           <description>Current bank is bank2</description>
                           <value>0x2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RWALL</name>
                     <description>Read/Write Allowed</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CTRLDIR</name>
                     <description>Control Direction</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CFGOK</name>
                     <description>Configuration OK Status</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BYCT</name>
                     <description>Byte Count</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>11</bitWidth>
                  </field>
               </fields>
            </register>
